CREATE TABLE t_zlj_wine_brand_list
  AS
    SELECT
      t1.cate_level2_name,
      t1.cate_level2_id,

      brand_name,
      brand_id,
      sold,
      sold_price
    FROM
      (
        SELECT *
        FROM t_base_ec_dim
        WHERE cate_level_id = 50008141

      ) t1

      JOIN (

             SELECT
               sum(day_sold)       sold,
               sum(day_sold_price) sold_price,
               brand_name,
               brand_id,
               cat_id

             FROM

               (
                 SELECT
                   brand_name,
                   brand_id,
                   cat_id,
                   item_id
                 FROM t_base_ec_item_dev
                 WHERE ds = 20160225 AND root_cat_id = 50008141 AND LENGTH(brand_id) > 5

               ) t4
               JOIN
               (
                 SELECT *
                 FROM
                   t_base_ec_item_daysale_dev
                 WHERE ds > 20160201
                       AND day_sold > 1
               ) t3 ON t3.item_id = t4.item_id
             GROUP BY brand_name, brand_id, cat_id

           ) t2
        ON t1.cate_id = t2.cat_id
    WHERE t2.sold > 2


#   order by t2.sold DESC
;
  select item_id, title from t_base_ec_record_dev_wine_20151130  where brand_name like "%杜康%"  limit 10;

CREATE TABLE t_base_ec_record_dev_wine_20151130
  AS
    SELECT
      item_id,
      title,
      feed_id,
      user_id,
      content_length,
      annoy,
      ds,
      datediff,
      cat_id,
      root_cat_id,
      root_cat_name,
      brand_id,
      brand_name,
      bc_type,
      price,
      location
    FROM t_base_ec_record_dev
    WHERE root_cat_id = 50008141 AND ds > 20151130
 and cat_id in
 ('50008144','50013052')

;


CREATE TABLE t_base_ec_record_dev_20151130
  AS
    SELECT
      item_id,
      title,
      feed_id,
      user_id,
      content_length,
      annoy,
      ds,
      datediff,
      cat_id,
      root_cat_id,
      root_cat_name,
      brand_id,
      brand_name,
      bc_type,
      price,
      location
    FROM t_base_ec_record_dev
    WHERE ds > 20151130;


CREATE TABLE t_base_ec_record_dev_wine_20151130_userinfo
  AS
    SELECT
      t1.*,
      tgender,
      tage,
      tname,
      tloc
    FROM t_base_ec_record_dev_wine_20151130 t1

      JOIN t_base_user_info_s t2 ON t1.user_id = t2.tb_id;


# tgender
# 0       189232  2.737971685999977E7
# 1       126396  1.7875574199999496E7

# 0       80291   1.2135912189999802E7
# 1       41484   6518951.670000019
SELECT
  tgender,
  count(1)   AS sale,
  sum(price) AS sale_p
FROM t_base_ec_record_dev_wine_20151130_userinfo
WHERE length(tgender) > 0
GROUP BY tgender;

#18-24  31458   3812377.97000003
#25-29  113656  1.5988441009999618E7
#30-34 70389   1.0314412079999967E7
#35-39 34065   5329867.85000003
#40-49 20774   3281719.6600000137
#50-59  3112    490805.42

#18-24 9171    1333648.4399999972
#25-29 41560   6489309.140000029
#30-34 28995   4458935.990000032
#35-39 15119   2324373.2900000033
#40-49 10148   1508111.7499999986
#50-59 1670    276878.75000000006
SELECT
  sum(CASE WHEN tage >= 18 AND tage <= 24
    THEN 1 END),
  sum(CASE WHEN tage >= 18 AND tage <= 24
    THEN price END),
  sum(CASE WHEN tage >= 25 AND tage <= 29
    THEN 1 END),
  sum(CASE WHEN tage >= 25 AND tage <= 29
    THEN price END),
  sum(CASE WHEN tage >= 30 AND tage <= 34
    THEN 1 END),
  sum(CASE WHEN tage >= 30 AND tage <= 34
    THEN price END),
  sum(CASE WHEN tage >= 35 AND tage <= 39
    THEN 1 END),
  sum(CASE WHEN tage >= 35 AND tage <= 39
    THEN price END),
  sum(CASE WHEN tage >= 40 AND tage <= 49
    THEN 1 END),
  sum(CASE WHEN tage >= 40 AND tage <= 49
    THEN price END),
  sum(CASE WHEN tage >= 50 AND tage <= 59
    THEN 1 END),
  sum(CASE WHEN tage >= 50 AND tage <= 59
    THEN price END)
FROM t_base_ec_record_dev_wine_20151130_userinfo
WHERE tage IS NOT NULL AND tage > 0;


#
# 上海    193953  2.8278087479999885E7
# 四川    95548   1.443118703999978E7
# 山西    66007   9533779.860000003
# 河南    144205  1.9817341409999482E7
# 甘肃    24272   3508910.1000000155
# 西藏    967     154096.02000000005
# 陕西    61668   8748541.1
# 黑龙江  56398   7922045.600000018
# 内蒙古  28310   4294616.630000029
# 北京    186870  2.3821488119999636E7
# 吉林    42045   5360323.920000049
# 安徽    117438  1.588863453999963E7
# 山东    240232  3.3327416569999974E7
# 广西    55966   8084231.0500000175
# 江西    61540   9025389.939999983
# 浙江    253469  3.767372621000032E7
# 海南    16017   2634894.750000004
# 湖北    108464  1.5819333119999573E7
# 福建    116860  1.6765331419999536E7
# 贵州    30533   4704117.410000036
# 重庆    42063   6340579.650000038
# 青海    4171    660269.0599999998
# 云南    35519   5113745.380000033
# 天津    61275   8309055.8700000085
# 宁夏    6576    945379.7099999983
# 广东    334361  4.747971313000277E7
# 新疆    15889   2717278.1500000027
# 江苏    310937  4.3835511420001246E7
# 河北    145596  2.1034918489999473E7
# 湖南    87009   1.2992127939999811E7
# 辽宁    98768   1.2894577969999788E7


# 上海    54492   9087681.399999967
# 云南    11968   1613981.3099999977
# 北京    63147   9009738.63999998
# 四川    38122   6166845.030000032
# 宁夏    3146    459209.2800000002
# 安徽    64497   8920929.46999996
# 江苏    150445  2.2593765029999364E7
# 江西    33279   4846205.420000044
# 河南    87362   1.189752575999978E7
# 浙江    84731   1.3731402719999697E7
# 湖南    43238   6545442.200000039
# 甘肃    13113   1917172.8100000003
# 福建    51221   7514911.32
# 西藏    441     72830.24999999999
# 重庆    16762   2524582.9600000074
# 青海    1607    247669.8600000001
# 内蒙古  13634   2183054.4599999995
# 吉林    17222   2318190.0100000026
# 天津    26480   3842112.4300000286
# 山东    140535  1.950997348999929E7
# 山西    40477   5899908.220000045
# 广东    121347  1.7087971949999325E7
# 广西    24705   3395862.5800000285
# 新疆    8502    1512679.4099999988
# 河北    91268   1.333205966999972E7
# 海南    6751    1053449.7499999981
# 湖北    48527   7335393.400000003
# 贵州    13755   2028311.4200000046
# 辽宁    35925   5018324.110000049
# 陕西    29255   4335567.090000039
# 黑龙江  23645   3521713.8800000204
SELECT
  loc,
  sum(1)     AS num,
  sum(price) AS sale_p
FROM
  (
    SELECT
      price,
      regexp_replace(split(tloc, '\\s+')[0], "省", "") AS loc
    FROM t_base_ec_record_dev_wine_20151130_userinfo
    WHERE tloc IS NOT NULL AND length(tloc) > 0

  ) t
GROUP BY loc;


#
#

CREATE TABLE t_base_ec_record_dev_20151130_wine_userbuy
  AS
    SELECT t1.*
    FROM t_base_ec_record_dev_20151130 t1 JOIN
      (
        SELECT DISTINCT user_id
        FROM t_base_ec_record_dev_wine_20151130
      ) t2 ON t1.user_id = t2.user_id;

(
# -       -       3801490
# 4536492 五粮液  112239
# 4537002 泸州老窖        99902
# 8224326 汾酒    85322
# 3517872 洋河蓝色经典    67112
# 3670389 洋河    56463
# 565376057       郑酒师  53669
# 4536490 牛栏山  52620
# 107380  南极人  49629
# 4101168 Moutai/茅台     48527
# 4119221 居家家  41649
# 107545  杏花村  41286
# 22048   001     34773
# 895926020       酒匪    33878
# 4013647 jimei   32133
# 10446017        Deli/得力       31858
# 106414794       优思居  30637
# 4210899 海之蓝  25902
# 308222371       醉贤庄  25477
# 43096241        醉卿    25364
# 48372943        还不晚  23894
# 3469821 Bejirog/北极绒  23892
# 64088949        草原喜顺        20830
# 29519   Septwolves/七匹狼       20701
# 30652   Midea/美的      20391
# 3269168 DIY     20116
# 4537006 西凤    19879
# 20328016        俏俏家居        19014
# 10246   Philips/飞利浦  17079
# 9664056 papala  17021
# 8831883 天之蓝  17016
# 10010   无      16948
# 123342703       爱美女人堂      16795
# 29510   PLAYBOY/花花公子        16409
# 97097173        原膳    16305
# 106096950       杏州    16292
# 3285400 自主品牌        16246
# 3237720 other   16155
# 109616236       Afs Jeep/战地吉普       15993
# 122657485       宜心    15974
# 3307152 蓝色经典        15865
# 274838064       易果生鲜        15777
# 53649   清风    15737
# 30111   Apple/苹果      15339
# 46864   恒源祥  14838
# 194916355       茶滋味  14488
# 81156   Samsung/三星    14464
# 27961   3M      14207
# 155276441       廉益坊  13397
# 10710059        闷倒驴  13381

)
#          sum(round(log2(cast(price AS FLOAT)) * pow(0.8, (datediff(from_unixtime(unix_timestamp(), 'yyyy-MM-dd'),
#                                                                    concat_ws('-', substring(ds, 1, 4),
#                                                                              substring(ds, 5, 2), substring(ds, 7, 2))))
#                                                          / 10.0) * 50, 4))
SELECT *
FROM (
       SELECT
         brand_id,
         brand_name,


         sum(1) AS score
       FROM
         t_base_ec_record_dev_20151130_wine_userbuy
       WHERE brand_name NOT LIKE '%其%'
       GROUP BY brand_id, brand_name
     ) t
ORDER BY score DESC
LIMIT 50;


(
# 50008144        国产白酒        1675107
# 50013003        葡萄酒  851086
# 50006846        短袜/打底袜/丝袜/美腿袜 451939
# 50008146        啤酒    362214
# 50013878        发饰    357544
# 50008882        内裤    348442
# 50012028        靴子    331589
# 150704  手机保护套/壳   317273
# 50012906        低帮鞋  267632
# 50008056        糖果    248584
# 50010513        传统糕点        240761
# 50012027        低帮鞋  235785
# 50010850        连衣裙  231603
# 162103  毛衣    230223
# 3035    休闲裤  217516
# 50007068        打底裤  211115
# 50008147        黄酒    202005
# 50013618        裤子    201184
# 50012010        女士包袋        186754
# 150401  中国移动充值卡  183919
# 50010535        膨化食品        182676
# 50007003        围巾/丝巾/披肩  171079
# 121370028       其他DIY饰品配件 169058
# 162201  休闲裤  162790
# 50000697        毛针织衫        161111
# 50012510        点心包装盒/包装袋       160975
# 50016845        方便面/粉丝/米线        159106
# 50011123        衬衫    158543
# 50012778        保暖套装        156718
# 50000671        T恤     152070
# 50013194        毛呢外套        150702
# 50000436        T恤     143694
# 121474010       面膜    141684
# 50012772        睡衣/家居服套装 141139
# 50011980        乳液/面霜       140963
# 50010167        牛仔裤  140826
# 50008899        羽绒服  138873
# 50008881        文胸    136377
# 50000557        针织衫/毛衣     135638
# 50025847        居家鞋  129019
# 150402  中国联通充值卡  128485
# 50010817        化妆/美容工具   125287
# 302910  帽子    122660
# 50013099        枣类制品        122231
# 162205  牛仔裤  121084
# 50008900        棉衣/棉服       120920
# 50008779        床品套件/四件套/多件套  117425
# 50000852        中老年女装      114390
# 50522003        威士忌/Whiskey  113067
# 50012587        手机贴膜        112960
)

(
# 50008144        国产白酒        5.195878102980015E7
# 50013003        葡萄酒  2.2580636606299967E7
# 50008146        啤酒    9409123.51029998
# 50012028        靴子    7576319.948699998
# 50012906        低帮鞋  7371156.032
# 50012027        低帮鞋  7030542.203000001
# 50010850        连衣裙  6093935.560300011
# 50006846        短袜/打底袜/丝袜/美腿袜 5463069.05180001
# 50008882        内裤    5297184.8608
# 3035    休闲裤  4883544.530800014
# 162103  毛衣    4762407.5703000035
# 50008147        黄酒    4651322.571400009
# 50012010        女士包袋        4567488.281099998
# 150704  手机保护套/壳   4107451.300199994
# 50007068        打底裤  3970883.4090999993
# 50013194        毛呢外套        3890831.814900016
# 50000697        毛针织衫        3827429.561200004
# 50013618        裤子    3688725.9416999994
# 162201  休闲裤  3607173.4241
# 50011123        衬衫    3529787.1469000042
# 50000671        T恤     3522606.8327000034
# 50000436        T恤     3478229.5806000005
# 50008899        羽绒服  3369687.896000002
# 50010513        传统糕点        3329506.353399997
# 1512    手机    3285375.563100003
# 50008779        床品套件/四件套/多件套  3239168.122799996
# 50010167        牛仔裤  3075143.175400003
# 50012772        睡衣/家居服套装 3068150.981699995
# 50007003        围巾/丝巾/披肩  3061052.858500001
# 50008056        糖果    3034461.0226000007
# 50522003        威士忌/Whiskey  2999086.714499996
# 162205  牛仔裤  2946499.9798000003
# 50010158        夹克    2882171.4418
# 50000557        针织衫/毛衣     2828358.8412
# 50008881        文胸    2771416.439600002
# 50000852        中老年女装      2749151.4051000006
# 50012778        保暖套装        2624532.1038999995
# 50011980        乳液/面霜       2549847.204900005
# 121474010       面膜    2523561.174900003
# 50013869        手链    2433184.0666
# 50008900        棉衣/棉服       2377398.9555999986
# 50019940        吸顶灯  2239154.6335000005
# 150401  中国移动充值卡  2209776.128100001
# 50008898        卫衣/绒衫       2208690.2186999978
# 122690003       双肩背包        2189637.8302999972
# 50012019        旅行箱  2118390.3805000028
# 121454006       腕表    2109489.968900001
# 162104  衬衫    2099245.976799998
# 1623    半身裙  2051672.928400002
# 50011165        棉衣    2027906.846000001
    )
# sum(round(log2(cast(price AS FLOAT)) * pow(0.8, (datediff(from_unixtime(unix_timestamp(), 'yyyy-MM-dd'),
#                                                                    concat_ws('-', substring(ds, 1, 4),
#                                                                              substring(ds, 5, 2), substring(ds, 7, 2))))
#                                                          / 10.0) * 10, 4))

(
# 50008144        国产白酒        1.0695503301130949E7
# 50012028        靴子    1322954.443251621
# 50012906        低帮鞋  1146759.4912852715
# 50012027        低帮鞋  819839.7062630912
# 162103  毛衣    781225.1505049783
# 3035    休闲裤  765936.3152683862
# 50010850        连衣裙  729176.4054127388
# 50013194        毛呢外套        693749.0244161669
# 50008899        羽绒服  649017.0243764246
# 50008882        内裤    631828.6134134115
# 50006846        短袜/打底袜/丝袜/美腿袜 603439.687779728
# 50012010        女士包袋        603070.3536874941
# 50007068        打底裤  562886.5580365269
# 50011123        衬衫    560957.7708213553
# 150704  手机保护套/壳   555404.9484028586
# 50010167        牛仔裤  524192.6665652084
# 50012778        保暖套装        519222.7901117992
# 50008779        床品套件/四件套/多件套  512741.66715803446
# 150401  中国移动充值卡  511899.8050893964
# 1512    手机    511830.8044511549
# 50008900        棉衣/棉服       507088.56274962553
# 50013003        葡萄酒  500754.6972192054
# 50000557        针织衫/毛衣     499864.2801507678
# 50013618        裤子    470084.39887552825
# 50011165        棉衣    469798.87429688754
# 50000852        中老年女装      464027.15577564505
# 50000697        毛针织衫        446772.15770958073
# 50012772        睡衣/家居服套装 444334.28220394545
# 162201  休闲裤  436248.7753167854
# 50010158        夹克    420286.456729888
# 50000436        T恤     415696.4537516099
# 50019940        吸顶灯  410444.203082118
# 50007003        围巾/丝巾/披肩  407774.42570845044
# 50011167        羽绒服  397845.6497523907
# 50010513        传统糕点        396561.0255718418
# 162205  牛仔裤  366036.19106478774
# 50013869        手链    361984.7554403965
# 50000671        T恤     361123.26361421467
# 50008881        文胸    354091.011944722
# 50024880        庭院植物/行道树木/果树  348510.2668410642
# 50012019        旅行箱  334238.2484540211
# 50011980        乳液/面霜       332485.30683002033
# 150402  中国联通充值卡  331902.7579993262
# 121454006       腕表    330303.55657112895
# 50008056        糖果    323406.1196385983
# 50011161        皮衣    313428.9218045119
# 50010825        被子/蚕丝被/羽绒被/棉被 304923.99111981026
# 121474010       面膜    301375.6289272171
# 50018813        纸尿裤/拉拉裤/纸尿片    294357.0476483769
# 122690003       双肩背包        293815.40660766314
)
#     cat_id,
# sum(log2(price))





select
  t1.cat_id, t2.cate_name,t1.score
  from
(
  SELECT
    cat_id,
sum(log2(price))
    AS score
  FROM
    t_base_ec_record_dev_20151130_wine_userbuy
  GROUP BY cat_id
)t1 join
t_base_ec_dim t2 on t1.cat_id=t2.cate_id

order by score desc limit 50 ;


CREATE TABLE t_base_ec_record_dev_20151130_wine_userbuy_userinfo
  AS
    SELECT
      t1.*,
      tgender,
      tage,
      tname,
      tloc
    FROM t_base_ec_record_dev_20151130_wine_userbuy t1

      JOIN t_base_user_info_s t2 ON t1.user_id = t2.tb_id;


0               需细分_1254128.63 爱酒_832242.99 持家_800124.08 爱美_387569.16 吃货_372021.56 有房_346270.27 下厨房_308020.37 送礼_276431.95 品质生活_246717.6 数码控_226818.91 有车_211887.91 有孩儿_204824.73 养生_195132.96 户外_150206.66 运动_136087.31 幼儿_134646.94 保健_119217.56 小资_115336.84 品质_97446.03 萌宠_91812.78 婴儿_88878.8 生活_82433.82 学习_82215.95 爱下厨_81829.6 理工男_81231.15 健身_77336.65 动手能力强_73215.5 爱茶_69196.04 行政_67542.44 品质男_47114.81 游戏达人_46285.62 爱读书_46281.63 office_45221.48 高品质_34902.07 细分_34632.95 二次元_29379.42 收藏家_28463.68 待产_26650.51 嘿嘿嘿_19980.17 O2O_18156.4 数码发烧友_17832.42 机车党_13154.98 旅游_11849.0 电驴一族_11690.15 音乐_11570.92 企鹅粉_6982.64 爱摄影_6889.63 文青_6889.63 手工爱好者_4950.49 活到老学到老_3761.57
               需细分_22388590.74 持家_13933282.98 爱酒_12083700.39 爱美_7860693.76 吃货_6254216.06 有房_5581118.65 送礼_4976031.4 下厨房_4822792.59 品质生活_4228905.2 有 孩儿_3936512.26 养生_3290777.73 数码控_2714978.73 有车_2607748.23 幼儿_2216760.27 保健_2087014.36 户外_2007741.33 运动_1930504.03 小资_1854571.15 品质_1488981.66 婴儿_1453124.62 萌宠_1452724.36 学习_1432726.31 爱下厨_1254164.13 生活_1229006.45 健身_1182401.76 爱茶_1044345.0 理工男_1034002.96 行政_997141.1 动手能力强_935460.93 爱读书_672938.9 office_609109.9 高品质_602144.0 细分_581758.72 品质男_570038.87 待产_447430.51 收藏家_418210.57 二次元_389877.84 游戏达人_366480.36 嘿嘿嘿_250020.87 数码发烧友_229009.42 O2O_211426.1 音乐_189655.81 旅游_178860.92 电驴一族_160869.79 机车党_150348.75 文青_103243.81 爱摄影_103243.81 手工爱好者_85280.67 近视_72015.49 美妆达人_72015.49