-- 105799295       帛柏旗舰店
-- 65525181        桥一电器专营店
-- 35432231        O lan独家定制
-- 110999350       森越旗舰店
-- 107903881       奥美圣酒类专营店
-- 103889467       亮鼎车品专营店
-- 72113206        北极绒睿狐专卖店
-- 105777081       deli西桔专卖店
-- 105951398       赛路胜宠物用品专营店
-- 104738351       菲利莫克服饰旗舰店
-- 144619358       余潇潇美妆店
-- 59288165        幸福像花儿一样1818
-- 110452617       居无限旗舰店
-- 59559926        光通信工厂一站采购店

select
shop_id ,shop_name
from
 t_base_ec_shop_dev_new
      WHERE ds = 20160615
      and shop_name in (
'赛路胜宠物用品专营店',
'桥一电器专营店',
'帛柏旗舰店',
'光通信工厂一站采购店',
'菲利莫克服饰旗舰店',
'森越旗舰店',
'O lan独家定制',
'余潇潇美妆店',
'北极绒睿狐专卖店',
'奥美圣酒类专营店',
'居无限旗舰店',
'幸福像花儿一样1818',
'deli西桔专卖店',
'亮鼎车品专营店')