
--keywords:
1)贷款类:
分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现


2)套现设备
一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机

3)资料造假类
挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号


4)兼职类
宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门
|加QQ|加q|+qq|卫星号|微信号|Q群|加我qq|加qq|微信|加V信|加v|加扣扣|qq|网络兼职|QQ卫星|日工资|V信|YY|VX|闪电|qq|


5)彩票类:
博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符


--关键词评估

CREATE table wl_service.t_lt_weibo_fraud_user_w1_tmp as
select id,name,description,
case when name
regexp'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现'
then regexp_extract(name,'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现',0) end as keywords_name,
case when description
regexp'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现'
then regexp_extract(description,'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现'
or
description regexp'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现' )



CREATE table wl_service.t_lt_weibo_fraud_user_w2_tmp as
select id,name,description,
case when name
regexp'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机'
then regexp_extract(name,'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机',0) end as keywords_name,
case when description
regexp'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机'
then regexp_extract(description,'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机'
or
description regexp'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机')


CREATE table wl_service.t_lt_weibo_fraud_user_w3_tmp as
select id,name,description,
case when name
regexp'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号'
then regexp_extract(name,'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号',0) end as keywords_name,
case when description
regexp'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号'
then regexp_extract(description,'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号'
or
description regexp'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号')


CREATE table wl_service.t_lt_weibo_fraud_user_tmp as
select id,name,description,
case when name
regexp'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门'
then regexp_extract(name,'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门',0) end as keywords_name,
case when description
regexp'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门'
then regexp_extract(description,'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门'
or
description regexp'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门')


CREATE table wl_service.t_lt_weibo_fraud_user_w5_tmp as
select id,name,description,
case when name
regexp'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符'
then regexp_extract(name,'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符',0) end as keywords_name,
case when description
regexp'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符'
then regexp_extract(description,'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符'
or
description regexp'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符')


--#关键词更新

贷款
抵押
拉卡拉
信用贷款
小额贷款
车贷
套现
网贷
借贷宝
借款
支付宝
借钱
薅羊毛
提现
快钱
急用钱
提额
宜信普惠
51人品
放贷
玖富
财付通
撸羊毛
放款
平安易贷
银行信贷
汇付天下
平安普惠
养卡
低息
你我贷
分期乐
翼龙贷
花呗套现
汇付
闪银
微贷网
好贷
贷款业务
诚信贷
瑞银信
宜人贷
陆金所
京东白条
拍拍贷
红岭创投
分期贷
人人贷
钱宝网
易贷网
网赚教程
低息贷款
玩转信用卡
有用分期
极速贷
飞贷
小微贷
新新贷
下款
百度钱包
天天付
有利网
51信用卡
白户贷款
黑户贷款
团贷网
爱钱进
微粒贷
手机贷
拿去花
和信贷
满标
网易宝
聚宝汇
卡利宝
低息借款
温商贷
随心贷
捞偏门
诺诺镑客
网贷技术
利息低
搜易贷
贷款技术
闪电借款
卡卡贷
开鑫贷
365易贷
跳码
贷款口子
来分期
网贷口子
珠宝贷
好贷宝
天汇融
金融口子
马上贷
博金贷
快易花
大学分期
宜人极速贷
银行小贷
58消费贷
极速放款
亲亲小贷
手机套现
聚宝匯
今借到
秒标
叮当贷
用钱宝
现金巴士
拍拍满
钱好贷
技术口子
宜贷网
小贷口子
等额本息
京东套现
连资贷
智付支付
无需担保
口子贷
51人品贷






--关键词hive表筛选
keywords
天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|任性付|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|卡拉卡|有用分期|玖富|小微贷|飞贷|今借到|大学分期|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|京东白条抢券工具|无视风控|白条代下单|贷款|黑户贷款|小额贷款操作|下款技术|小额贷款|信用贷款|小额借钱|贷款秒下|无视黑白|无征信|无视征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|网贷|一清机|撸羊毛|包下款|薅羊毛|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|信用卡贷款|借款培训|京东套现|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|口子|低息贷款|低息|下款|借款|放米|强开提额|典当|金融|乐富|借条|低息|速贷|信用卡|网赚|包装小贷|包装公司|抵押|提现|借呗|黑户|跳码|燃眉之急|信用贷|借钱|借贷|额度|借款|芝麻信用|急用钱|急借钱|典当行|放贷|还款|拆借|快借|资金困难|资金短缺|放米|快钱|套现|变现|t现|急缺钱|口子|急需资金|抢标|秒标|不需担保|无担保|秒批|秒到|提额|降额|放款|下款|缺钱转|点刷|卡乐付|pos机|刷卡机|手刷|多商户|实时到账|费率|乐刷|易付宝|poss机|ps机|蓝牙POS|蓝牙刷卡机|蓝牙刷卡器|POS刷卡器|刷卡器费率|手机POSS|收款宝|拉卡拉|刷卡机|变现|P2P|蓝牙|pos刷卡器|速刷|汇付|秒到账|手机pos|一机|实时到帐|贷款|车贷|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款|征信代打|电核流水|销户|代做|银行流水|工资流水|收入证明|社保|公积金|挂靠|代缴|代交|邮箱批发|企业邮箱|邮箱|单位邮箱|公司邮箱|邮箱账号|闪银|Wecash闪银|闪电|51人品|资金周转|代办|学历证书|学位证书|流水回单|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|固话|银行小贷|下卡|博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|中奖符|赌博符|还钱符|网赚|兼职|项目|快速赚钱|偏门|工资日结|营销软件|贷款|教程|京东号|JD号|京东三绑账号|全绑|京东小号|小号批发|借条|催款函|答辩状|罚单|反诉|房产纠纷|行政复议|行政诉讼|合同纠纷|取保|候审|缓刑|强制执行|查封|冻结扣款|失信|老赖|上诉书|上诉状|诉讼状|诉状|律师函|法律|咨询|债权债务|借款|贷款|纠纷|抵押担保|质押|打官司|起诉|起诉书|起诉状|高利贷

--create table
insert OVERWRITE table wl_analysis.t_lt_weibo_fraud_usr
select id,name,description,
case when name
regexp'天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|网贷|一清机|撸羊毛|包下款|薅羊毛|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|信用卡贷款|借款培训|京东套现|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行月利息|银行信贷|营销软件|车贷|挂靠|借贷|提现|急用钱|公积金|套现|网贷|费率|手机POS|刷卡机|信用贷|手机pos|提额|51人品|P2P|POS刷卡器|	pos刷卡器|兼职|抵押|亲亲小贷|强开提额|微粒代|连资贷|天汇融|秒标|博金贷|低息借款|瞬时贷|黑户贷款|刷卡手续费|贷款|信用贷款|抵押|无担保|无需担保|小额贷款|贷款业务|急用钱|跳码|蓝牙刷卡器|pos机|IC刷卡器|现金巴士|有利网|搜易贷|和信贷|新新贷|诉讼案件|极速放款|poss机|放款|信用卡|套现|淘宝兼职|网上兼职|日赚|薪水日结|淘宝刷信誉|兼职赚钱|利息低|放贷|低息贷款|捞偏门|下款|拆借|借呗|钱好贷|汇付|闪银|网赚教程|蓝牙POS|房贷|小额贷|银行贷|POS机|小贷口子|养卡|急缺钱|借呗|快速赚钱|白户贷款|玩转信用卡|贷款包装|包过电核|固话代接|代接回访|代接固话|公积金转移|电话代接|银行小贷|代做银行流水'
then regexp_extract(name,'天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|网贷|一清机|撸羊毛|包下款|薅羊毛|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|信用卡贷款|借款培训|京东套现|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行月利息|银行信贷|营销软件|车贷|挂靠|借贷|提现|急用钱|公积金|套现|网贷|费率|手机POS|刷卡机|信用贷|手机pos|提额|51人品|P2P|POS刷卡器|	pos刷卡器|兼职|抵押|亲亲小贷|强开提额|微粒代|连资贷|天汇融|秒标|博金贷|低息借款|瞬时贷|黑户贷款|刷卡手续费|贷款|信用贷款|抵押|无担保|无需担保|小额贷款|贷款业务|急用钱|跳码|蓝牙刷卡器|pos机|IC刷卡器|现金巴士|有利网|搜易贷|和信贷|新新贷|诉讼案件|极速放款|poss机|放款|信用卡|套现|淘宝兼职|网上兼职|日赚|薪水日结|淘宝刷信誉|兼职赚钱|利息低|放贷|低息贷款|捞偏门|下款|拆借|借呗|钱好贷|汇付|闪银|网赚教程|蓝牙POS|房贷|小额贷|银行贷|POS机|小贷口子|养卡|急缺钱|借呗|快速赚钱|白户贷款|玩转信用卡|贷款包装|包过电核|固话代接|代接回访|代接固话|公积金转移|电话代接|银行小贷|代做银行流水',0) end as keywords_name,
case when description
regexp'天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|网贷|一清机|撸羊毛|包下款|薅羊毛|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|信用卡贷款|借款培训|京东套现|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行月利息|银行信贷|营销软件|车贷|挂靠|借贷|提现|急用钱|公积金|套现|网贷|费率|手机POS|刷卡机|信用贷|手机pos|提额|51人品|P2P|POS刷卡器|	pos刷卡器|兼职|抵押|亲亲小贷|强开提额|微粒代|连资贷|天汇融|秒标|博金贷|低息借款|瞬时贷|黑户贷款|刷卡手续费|贷款|信用贷款|抵押|无担保|无需担保|小额贷款|贷款业务|急用钱|跳码|蓝牙刷卡器|pos机|IC刷卡器|现金巴士|有利网|搜易贷|和信贷|新新贷|诉讼案件|极速放款|poss机|放款|信用卡|套现|淘宝兼职|网上兼职|日赚|薪水日结|淘宝刷信誉|兼职赚钱|利息低|放贷|低息贷款|捞偏门|下款|拆借|借呗|钱好贷|汇付|闪银|网赚教程|蓝牙POS|房贷|小额贷|银行贷|POS机|小贷口子|养卡|急缺钱|借呗|快速赚钱|白户贷款|玩转信用卡|贷款包装|包过电核|固话代接|代接回访|代接固话|公积金转移|电话代接|银行小贷|代做银行流水'
then regexp_extract(description,'天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|网贷|一清机|撸羊毛|包下款|薅羊毛|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|信用卡贷款|借款培训|京东套现|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行月利息|银行信贷|营销软件|车贷|挂靠|借贷|提现|急用钱|公积金|套现|网贷|费率|手机POS|刷卡机|信用贷|手机pos|提额|51人品|P2P|POS刷卡器|	pos刷卡器|兼职|抵押|亲亲小贷|强开提额|微粒代|连资贷|天汇融|秒标|博金贷|低息借款|瞬时贷|黑户贷款|刷卡手续费|贷款|信用贷款|抵押|无担保|无需担保|小额贷款|贷款业务|急用钱|跳码|蓝牙刷卡器|pos机|IC刷卡器|现金巴士|有利网|搜易贷|和信贷|新新贷|诉讼案件|极速放款|poss机|放款|信用卡|套现|淘宝兼职|网上兼职|日赚|薪水日结|淘宝刷信誉|兼职赚钱|利息低|放贷|低息贷款|捞偏门|下款|拆借|借呗|钱好贷|汇付|闪银|网赚教程|蓝牙POS|房贷|小额贷|银行贷|POS机|小贷口子|养卡|急缺钱|借呗|快速赚钱|白户贷款|玩转信用卡|贷款包装|包过电核|固话代接|代接回访|代接固话|公积金转移|电话代接|银行小贷|代做银行流水',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20161123' and (
name regexp'天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|网贷|一清机|撸羊毛|包下款|薅羊毛|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|信用卡贷款|借款培训|京东套现|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行月利息|银行信贷|营销软件|车贷|挂靠|借贷|提现|急用钱|公积金|套现|网贷|费率|手机POS|刷卡机|信用贷|手机pos|提额|51人品|P2P|POS刷卡器|	pos刷卡器|兼职|抵押|亲亲小贷|强开提额|微粒代|连资贷|天汇融|秒标|博金贷|低息借款|瞬时贷|黑户贷款|刷卡手续费|贷款|信用贷款|抵押|无担保|无需担保|小额贷款|贷款业务|急用钱|跳码|蓝牙刷卡器|pos机|IC刷卡器|现金巴士|有利网|搜易贷|和信贷|新新贷|诉讼案件|极速放款|poss机|放款|信用卡|套现|淘宝兼职|网上兼职|日赚|薪水日结|淘宝刷信誉|兼职赚钱|利息低|放贷|低息贷款|捞偏门|下款|拆借|借呗|钱好贷|汇付|闪银|网赚教程|蓝牙POS|房贷|小额贷|银行贷|POS机|小贷口子|养卡|急缺钱|借呗|快速赚钱|白户贷款|玩转信用卡|贷款包装|包过电核|固话代接|代接回访|代接固话|公积金转移|电话代接|银行小贷|代做银行流水'
or
description regexp'天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|网贷|一清机|撸羊毛|包下款|薅羊毛|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|信用卡贷款|借款培训|京东套现|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行月利息|银行信贷|营销软件|车贷|挂靠|借贷|提现|急用钱|公积金|套现|网贷|费率|手机POS|刷卡机|信用贷|手机pos|提额|51人品|P2P|POS刷卡器|	pos刷卡器|兼职|抵押|亲亲小贷|强开提额|微粒代|连资贷|天汇融|秒标|博金贷|低息借款|瞬时贷|黑户贷款|刷卡手续费|贷款|信用贷款|抵押|无担保|无需担保|小额贷款|贷款业务|急用钱|跳码|蓝牙刷卡器|pos机|IC刷卡器|现金巴士|有利网|搜易贷|和信贷|新新贷|诉讼案件|极速放款|poss机|放款|信用卡|套现|淘宝兼职|网上兼职|日赚|薪水日结|淘宝刷信誉|兼职赚钱|利息低|放贷|低息贷款|捞偏门|下款|拆借|借呗|钱好贷|汇付|闪银|网赚教程|蓝牙POS|房贷|小额贷|银行贷|POS机|小贷口子|养卡|急缺钱|借呗|快速赚钱|白户贷款|玩转信用卡|贷款包装|包过电核|固话代接|代接回访|代接固话|公积金转移|电话代接|银行小贷|代做银行流水' )







--analysis
select keywords_disc, count(1) as num from t_lt_weibo_fraud_usr
group by keywords_disc





--
 / trans / lel / t_lt_base_fraud_item_seller_id.tbsnwb
 / trans / lel / t_lt_weibo_fraud_usr.snwbtb


-- follow each other

wl_service.t_lel_weibo_abnomal_fri
t_lt_weibo_usr_fri_multline

--1.all friends of fraud weibo user
create table wl_service.t_lt_weibo_fruad_id_follows as
SELECT snwb,friend from
(SELECT t2.* from
(SELECT id from wl_analysis.t_lt_weibo_fraud_usr)t1
join
(SELECT * FROM wl_service.t_lt_weibo_usr_fri_multline)t2
on t1.id=t2.snwb
union all
SELECT t2.* from
(SELECT id from wl_analysis.t_lt_weibo_fraud_usr)t1
join
(SELECT * FROM wl_service.t_lt_weibo_usr_fri_multline)t2
on t1.id=t2.friend)t
group by snwb,friend

--bifollow users's info
create table t_lt_weibo_fraud_usr_tmp as
SELECT t1.*,t2.name as name_a,t2.description as description_a,
t2.keywords_name as keywords_a,t2.keywords_disc as desc_key_a from
(SELECT * FROM wl_service.t_lel_weibo_abnomal_fri) t1
left join
(SELECT * from wl_analysis.t_lt_weibo_fraud_usr) t2
on t1.ida=t2.id

drop table t_lt_weibo_fraud_usr_bifollow_info;
create table t_lt_weibo_fraud_usr_bifollow_info as
SELECT t1.*,t2.name as name_b,t2.description as description_b,
t2.keywords_name as keywords_b,t2.keywords_disc as desc_key_b from
(SELECT * FROM wl_analysis.t_lt_weibo_fraud_usr_tmp) t1
left join
(SELECT * from wl_analysis.t_lt_weibo_fraud_usr) t2
on t1.idb=t2.id

drop table t_lt_weibo_fraud_usr_tmp;

