
--keywords:
1)贷款类:
分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现


2)套现设备
一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机

3)资料造假类
挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号


4)兼职类
宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门
|加QQ|加q|+qq|卫星号|微信号|Q群|加我qq|加qq|微信|加V信|加v|加扣扣|qq|网络兼职|QQ卫星|日工资|V信|YY|VX|闪电|qq|


5)彩票类:
博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符


--关键词评估

CREATE table wl_service.t_lt_weibo_fraud_user_w1_tmp as
select id,name,description,
case when name
regexp'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现'
then regexp_extract(name,'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现',0) end as keywords_name,
case when description
regexp'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现'
then regexp_extract(description,'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现'
or
description regexp'分期贷|天天付|瑞银信|陆金所|红岭创投|微贷网|聚宝匯|聚宝汇|宜贷网|爱钱进|宜人贷|团贷网|翼龙贷|你我贷|嘉卡贷|搜易贷|好贷宝|有利网|拿去花|人人贷|温商贷|开鑫贷|博金贷|365易贷|珠宝贷|新新贷|和信贷|连资贷|诚信贷|微粒贷|拍拍贷|拍拍满|借趣花|51人品|平安易贷|51信用卡|易贷网|平安普惠|快易花|亲亲小贷|马上贷|51人品贷|瞬时贷|随心贷|广发零用钱|现金巴士|极速贷|手机贷|租房贷|用钱宝|小秒钱包|58消费贷|闪电借款|宜人极速贷|卡卡贷|有用分期|玖富|小微贷|飞贷|今借到|大学分期|联银鑫宝|宜信普惠|民工分期|蓝领分期|好贷|钱宝网|汇付天下|叮当贷|借贷宝|诺诺镑客|卡利宝|甜橙白条|分期乐|来分期|京东白条|微粒代|连资贷|天汇融|秒标|博金贷|闪银|钱好贷|汇付|支付宝|财付通|快钱|网易宝|智付支付|百度钱包|拉卡拉|贷款|黑户贷款|小额贷款|下款技术|信用贷款|借钱|贷款秒下|无征信|黑户下卡|白户贷款|无视网黑|满标|等额本息|网贷口子|贷款技术|贷款口子|抵押|网贷|撸羊毛|包下款|薅羊毛|京东套现|花呗套现|借呗套现|套现|借款培训|抵押套现|还款技术|技术口子|网赚教程|下款利器|玩转信用卡|口子教程|网络速贷|小贷资料|银行口子|极速放款|低息借款|低息代款|金融口子|网贷技术|小贷口子|口子贷|贷口子|手机套现|低息贷款|低息|下款|借款|强开提额|银行信贷|车贷|借贷提现|急用钱|提现|提额|无需担保|贷款业务|跳码|放款|利息低|放贷|捞偏门|养卡|银行小贷|微信套现' )



CREATE table wl_service.t_lt_weibo_fraud_user_w2_tmp as
select id,name,description,
case when name
regexp'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机'
then regexp_extract(name,'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机',0) end as keywords_name,
case when description
regexp'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机'
then regexp_extract(description,'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机'
or
description regexp'一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机')


CREATE table wl_service.t_lt_weibo_fraud_user_w3_tmp as
select id,name,description,
case when name
regexp'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号'
then regexp_extract(name,'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号',0) end as keywords_name,
case when description
regexp'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号'
then regexp_extract(description,'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号'
or
description regexp'挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号')


CREATE table wl_service.t_lt_weibo_fraud_user_tmp as
select id,name,description,
case when name
regexp'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门'
then regexp_extract(name,'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门',0) end as keywords_name,
case when description
regexp'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门'
then regexp_extract(description,'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门'
or
description regexp'宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门')


CREATE table wl_service.t_lt_weibo_fraud_user_w5_tmp as
select id,name,description,
case when name
regexp'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符'
then regexp_extract(name,'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符',0) end as keywords_name,
case when description
regexp'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符'
then regexp_extract(description,'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符',0) end as keywords_disc
from wl_base.t_base_weibo_user_new
where ds = '20170502' and (
name regexp'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符'
or
description regexp'博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符')


--#关键词更新
select keywords_name as key,count(1) as num from t_lt_weibo_fraud_user_w1_tmp
group by keywords_name
union all
select keywords_disc as key,count(1) as num from t_lt_weibo_fraud_user_w1_tmp
group by keywords_disc;


select * from t_lt_weibo_fraud_user_w1_tmp
where keywords_disc=='支付宝' or keywords_name=='支付宝';


1)贷款类:
借贷宝|消费贷|友信|花呗|白条|任性付|大学生贷款||京东白条|唯品会额度|分期乐|趣分期|学历贷
提额|养卡|提现|套现|借钱|黑户|白户|二手房|房贷|办理|信贷|放款|下款|信用卡|理财|担保|投资|融资|提现|质押|抵押|贷款|贷款咨询|贷款资讯|二手房买卖|理财咨询师|银行贷款|债权追讨|买车买房|专业贷款|贷款公司|企业贷款|企业融资|银行抵押|资金需要|低息贷款
|金融机构|投资理财|金融贷款|房产抵押|土地抵押|贷款指南|信用借款|小额贷款|快速贷款|信用贷款|急用钱|应急贷款|包装贷款|贷款包装|大额空放|过桥解压|民间贷款|贷款找我|按揭贷款|公积金贷款|利息低|
额度|刷卡贷款|消费贷款|个人贷款|小额信贷|代办POS机|投资贷款|网络贷款|资金需求|要贷款的来找我|各类贷款|贷款软件|保险|平安贷款|二手房过户|避税|pos|贷款数据库|民间借贷



2)套现设备
pos机|POS机|信用卡|贷款|拉卡拉|易宝|乐富|办理|收款宝|刷卡机|银联|费率|信用卡还款

一清机|手机POSS机|手机POS机|手机刷卡机|手机刷卡器|信用卡刷卡器|移动POS机|强开贷款|费率|手机POS|刷卡机|信用贷|手机pos|P2P|POS刷卡器|pos刷卡器|IC刷卡器|pos机|蓝牙刷卡器|poss机|蓝牙POS|金融一体机

3)资料造假类
挂靠|公积金|社保|公积金转移|电话代接|代做银行流水|提额认证|闪银认证|闪银提额|不良记录|身份证抠图|代做企业对公流水账|代做普通流水账|银行贷款报表|处理逾期|经营异常|借款逾期|账单技术|代过人脸识别|代过各种人脸识别|闪银|贷款|借款|贷款包装|包过电核|固话代接|代接回访|代接固话|信用卡|银行回访|单位包装|贷款回访|电话回访|回访专用|单位回访|公积金转移|电话代接|回访|呼叫转移|银行小贷|下卡|代接|邮箱批发|征信代打|账号批发|京东三绑账号

代办|公积金|提取|贷款|社保纳税证明

4)兼职类
宝妈|兼职|兼职群|兼职推广|网上兼职|日赚|工资日结|薪水日结|淘宝刷信誉|兼职赚钱|快速赚钱|网上兼职|赚钱|挣钱|暴利|网赚|网赚项目|工资日结|营销软件|贷款|网赚教程|捞偏门
|加QQ|加q|+qq|卫星号|微信号|Q群|加我qq|加qq|微信|加V信|加v|加扣扣|qq|网络兼职|QQ卫星|日工资|V信|YY|VX|闪电|qq|


5)彩票类:
博彩|彩票|时时彩|七乐彩|双色球|彩票中奖|大乐透|彩票软件|彩票分析软件|500万|中奖符|赌博符|还钱符



法律中介咨询服务








--analysis
select keywords_disc, count(1) as num from t_lt_weibo_fraud_usr
group by keywords_disc





--
 / trans / lel / t_lt_base_fraud_item_seller_id.tbsnwb
 / trans / lel / t_lt_weibo_fraud_usr.snwbtb


-- follow each other

wl_service.t_lel_weibo_abnomal_fri
t_lt_weibo_usr_fri_multline

--1.all friends of fraud weibo user
create table wl_service.t_lt_weibo_fruad_id_follows as
SELECT snwb,friend from
(SELECT t2.* from
(SELECT id from wl_analysis.t_lt_weibo_fraud_usr)t1
join
(SELECT * FROM wl_service.t_lt_weibo_usr_fri_multline)t2
on t1.id=t2.snwb
union all
SELECT t2.* from
(SELECT id from wl_analysis.t_lt_weibo_fraud_usr)t1
join
(SELECT * FROM wl_service.t_lt_weibo_usr_fri_multline)t2
on t1.id=t2.friend)t
group by snwb,friend

--bifollow users's info
create table t_lt_weibo_fraud_usr_tmp as
SELECT t1.*,t2.name as name_a,t2.description as description_a,
t2.keywords_name as keywords_a,t2.keywords_disc as desc_key_a from
(SELECT * FROM wl_service.t_lel_weibo_abnomal_fri) t1
left join
(SELECT * from wl_analysis.t_lt_weibo_fraud_usr) t2
on t1.ida=t2.id

drop table t_lt_weibo_fraud_usr_bifollow_info;
create table t_lt_weibo_fraud_usr_bifollow_info as
SELECT t1.*,t2.name as name_b,t2.description as description_b,
t2.keywords_name as keywords_b,t2.keywords_disc as desc_key_b from
(SELECT * FROM wl_analysis.t_lt_weibo_fraud_usr_tmp) t1
left join
(SELECT * from wl_analysis.t_lt_weibo_fraud_usr) t2
on t1.idb=t2.id

drop table t_lt_weibo_fraud_usr_tmp;

